Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickType
The pick types.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickType.DM_PICK_NONE
Pick nothing.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickType.DM_PICK_OBJECT
Pick an object.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickType.DM_PICK_OBJECTS
Pick several objects.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickType.DM_PICK_POINT
Pick a point.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickType.DM_PICK_POINTS
Pick several points.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickType.DM_PICK_FACE
Pick a face.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickType.DM_PICK_LINE
Pick a line.